In [2]:
import numpy as np
import pandas as pd

In [3]:
url='https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user'
df=pd.read_csv(url,sep='|')
df.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

In [4]:
df=df.rename(columns = {'user_id':'users'})
df.head()

   users  age gender  occupation zip_code
0      1   24      M  technician    85711
1      2   53      F       other    94043
2      3   23      M      writer    32067
3      4   24      M  technician    43537
4      5   33      F       other    15213

In [6]:
df.head(10)

   users  age gender     occupation zip_code
0      1   24      M     technician    85711
1      2   53      F          other    94043
2      3   23      M         writer    32067
3      4   24      M     technician    43537
4      5   33      F          other    15213
5      6   42      M      executive    98101
6      7   57      M  administrator    91344
7      8   36      M  administrator    05201
8      9   29      M        student    01002
9     10   53      M         lawyer    90703

In [7]:
df.tail(10)

     users  age gender     occupation zip_code
933    934   61      M       engineer    22902
934    935   42      M         doctor    66221
935    936   24      M          other    32789
936    937   48      M       educator    98072
937    938   38      F     technician    55038
938    939   26      F        student    33319
939    940   32      M  administrator    02215
940    941   20      M        student    97229
941    942   48      F      librarian    78209
942    943   22      M        student    77841

In [8]:
print("Number of Rows:",len(df.index))

Number of Rows: 943

In [9]:
print("Number of columns:",len(df.columns))

Number of columns: 5

In [10]:
print(df.columns)

Index(['users', 'age', 'gender', 'occupation', 'zip_code'], dtype='object')

In [11]:
df.set_index("users",inplace=True)
df.head()

       age gender  occupation zip_code
users
1       24      M  technician    85711
2       53      F       other    94043
3       23      M      writer    32067
4       24      M  technician    43537
5       33      F       other    15213

In [15]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
Int64Index: 943 entries, 1 to 943
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   age         943 non-null    int64
 1   gender      943 non-null    object
 2   occupation  943 non-null    object
 3   zip_code    943 non-null    object
dtypes: int64(1), object(3)
memory usage: 36.8+ KB
None

In [22]:
len(pd.unique(df['occupation']))

21

In [23]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
Int64Index: 943 entries, 1 to 943
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   age         943 non-null    int64
 1   gender      943 non-null    object
 2   occupation  943 non-null    object
 3   zip_code    943 non-null    object
dtypes: int64(1), object(3)
memory usage: 36.8+ KB
None

In [24]:
df.describe()

              age
count  943.000000
mean    34.051962
std     12.192740
min      7.000000
25%     25.000000
50%     31.000000
75%     43.000000
max     73.000000

In [28]:
df.occupation.value_counts()

student          196
other            105
educator          95
administrator     79
engineer          67
programmer        66
librarian         51
writer            45
executive         32
scientist         31
artist            28
technician        27
marketing         26
entertainment     18
healthcare        16
retired           14
lawyer            12
salesman          12
none               9
homemaker          7
doctor             7
Name: occupation, dtype: int64

In [29]:
mean_age=df.age.mean()
print(mean_age)

34.05196182396607

In [31]:
min_age=df.age.min()
print(min_age)

7